{
  "backend/main.mo": "Main canister defining product, cart, order, user profile, and category types with admin-gated CRUD logic and seeded demo data using access control mixin.",
  "backend/migration.mo": "Migration module that maps old actor state to the new format without transforming data fields.",
  "feature_evidence.json": "Report listing implemented features, associated files, components, and requirement IDs for admin bootstrap and admin-grant flows.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in routing, UI, auth, admin tools, and seller pages.",
  "frontend/index.css": "Tailwind base configuration defining color variables, theming rules, and global styles for light/dark modes.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, theme provider, layout, and global toaster.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI component showing an access denied message with optional required role and navigation back home.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state, loading, and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting authenticated users without a profile to submit name and email, saving via a profile mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and displays a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Checks user role and identity, showing a loading spinner or access‑denied screen if permission is insufficient.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper that includes top navigation, secondary navigation, footer, and page content.",
  "frontend/src/components/layout/Footer.tsx": "Displays site footer with brand info, contact details, legal links, and attribution.",
  "frontend/src/components/layout/SecondaryNav.tsx": "Renders a horizontal category navigation bar driven by fetched product categories.",
  "frontend/src/components/layout/TopNav.tsx": "Provides the top navigation bar with logo, search, account menu, cart preview, and mobile navigation handling.",
  "frontend/src/components/storefront/HeroCarousel.tsx": "Auto‑rotating hero image carousel with navigation controls and CTA buttons linking to product pages.",
  "frontend/src/components/storefront/PromoGrid.tsx": "Grid of promotional category cards that navigate to filtered product lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, loading stored identities, and exposing authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, admin actions, and backend interactions using an actor and identity context.",
  "frontend/src/index.css": "Sets global Tailwind styles, theme variables, fonts, and custom utilities for the app's design system.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides an admin overview of products, orders, revenue, and tools to assign admin roles by principal or email.",
  "frontend/src/pages/admin/AdminProductFormPage.tsx": "Form for creating or editing products, loading existing data when editing and submitting changes to the backend.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page that lists products with actions to add, edit, and delete, using queries and role protection.",
  "frontend/src/pages/auth/AdminLoginPage.tsx": "Admin login page handling Internet Identity auth, admin checks, owner bootstrap, and redirects based on role.",
  "frontend/src/pages/auth/CustomerLoginPage.tsx": "Customer login screen using Internet Identity that redirects to home after authentication.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart page, fetching cart items, displaying product details, and allowing quantity updates and removals.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout form, computes order totals, validates shipping info, and triggers order placement.",
  "frontend/src/pages/HomePage.tsx": "Displays the storefront homepage with hero carousel, promo grid, featured products, and deals sections.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays details of a completed order, fetching order and product data and showing items, totals, and navigation options.",
  "frontend/src/pages/OrdersPage.tsx": "Lists all user orders with summaries and product previews, handling loading, empty states, and navigation to order details.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info, handles add‑to‑cart actions, and displays similar products based on category.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a product catalog with category filters, search support, and responsive filter UI.",
  "frontend/src/pages/seller/SellerDashboardPage.tsx": "Empty placeholder page for the seller dashboard.",
  "frontend/src/pages/seller/SellerProductFormPage.tsx": "Empty placeholder page for the seller product form.",
  "frontend/src/utils/pricing.ts": "Utility functions for calculating line totals, subtotals, taxes, totals, and formatting prices.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project state metadata describing scope, architecture, known issues, and implemented features of the Nexo Market project."
}